src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <comment>(Общ)</comment>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НоменклатурныеГруппы</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждатьОНецелыхМестах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержитЕХО</name>
    <comment>Содержит единиц хранения остатков (используется для логистики)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ЕдиницыИзмерения/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаКлиенте
Перем БазоваяЕдиницаНоменклатурыНаименование;

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если НЕ ЭтоЕдиницаИзмеренияНоменклатуры Тогда
        Возврат;
	КонецЕсли;	
	
	ДоступностьПорогаОкругления = (ЗначениеЗаполнено(Объект.Владелец) И БазоваяЕдиницаНоменклатуры <> Объект.ЕдиницаПоКлассификатору);
	
	Элементы.ПорогОкругления.Доступность = ДоступностьПорогаОкругления;
    Элементы.ПредупреждатьОНецелыхМестах.Доступность = ДоступностьПорогаОкругления;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформационныеНадписи()
	
	Если Объект.ПорогОкругления = 0 Тогда
		Элементы.ИнформацияОбОкруглении.Заголовок = "(в сторону уменьшения)";
	Иначе
	    Элементы.ИнформацияОбОкруглении.Заголовок = "("+Объект.ПорогОкругления+" "+ БазоваяЕдиницаНоменклатурыНаименование +" и более = 1 "+СокрЛП(Объект.Наименование)+")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаПоКлассификаторуПриИзменении(Элемент)
	
	Объект.Наименование = Строка(Объект.ЕдиницаПоКлассификатору);
	
	УстановитьДоступность();
	Если ЗначениеЗаполнено(Объект.Владелец) И БазоваяЕдиницаНоменклатуры = Объект.ЕдиницаПоКлассификатору Тогда
		Объект.ПорогОкругления = 0;
		Объект.ПредупреждатьОНецелыхМестах = ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорогОкругленияПриИзменении(Элемент)
	
	ОбновитьИнформационныеНадписи();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ОбновитьИнформационныеНадписи();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

		Если Объект.Коэффициент = 0 Тогда
			Объект.Коэффициент = 1;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Объект.ЕдиницаПоКлассификатору) Тогда
			Объект.ЕдиницаПоКлассификатору = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяЕдиницаПоКлассификатору");
		КонецЕсли;

	КонецЕсли;
	
	ЕдиницаИзмеренияВеса = Константы.ЕдиницаИзмеренияВеса.Получить();
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) Тогда
		Элементы.Вес.Заголовок = "Вес (" + СокрЛП(ЕдиницаИзмеренияВеса)+")";
	КонецЕсли;

	ЕдиницаИзмеренияОбъема = Константы.ЕдиницаИзмеренияОбъема.Получить();
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияОбъема) Тогда
		Элементы.Объем.Заголовок = "Объем (" + СокрЛП(ЕдиницаИзмеренияОбъема) +")";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
    	БазоваяЕдиницаНоменклатуры = Объект.Владелец.БазоваяЕдиницаИзмерения;
		БазоваяЕдиницаНоменклатурыНаименование = СокрЛП(БазоваяЕдиницаНоменклатуры);
		Элементы.Коэффициент.Заголовок = "Содержит (" + БазоваяЕдиницаНоменклатурыНаименование +")";
	КонецЕсли;
	
	ЭтоЕдиницаИзмеренияНоменклатуры = (ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Номенклатура"));
	
	Если НЕ ЭтоЕдиницаИзмеренияНоменклатуры Тогда
		Элементы.ПорогОкругления.Видимость = ложь;
		Элементы.ИнформацияОбОкруглении.Видимость = ложь;
		Элементы.ПредупреждатьОНецелыхМестах.Видимость = ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();
	ОбновитьИнформационныеНадписи();
	
КонецПроцедуры
